Revit 2026 API

# DetailFailures Properties

---

The BuiltInFailuresDetailFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EavesAreAligned | All eaves are already aligned. |
|  | NeedsTwoToAlignEaves | At least two Slope Defining Lines are needed to perform Align Eaves. |
|  | RepeatingDetailSpacingZeroError | Spacing must be greater than 0 |

#### Reference

BuiltInFailuresDetailFailures Class

Autodesk.Revit.DB Namespace